Newtonian/zo=0.1mm_f=3.69Hz/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type uniformFixedValue;
        uniformValue sine;
        uniformValueCoeffs
        {
            amplitude 0.00232;
	    	scale     (0 0 1);
            frequency 3.69;
            start     0;
            level     (0 0 0);
        }
    }

    outlet
    {
		type uniformFixedValue;
        uniformValue sine;
        uniformValueCoeffs
        {
            amplitude 0.00232;
	    	scale     (0 0 1);
            frequency 3.69;
            start     0;
            level     (0 0 0);
        }
    }
	
    walls
    {
		type noSlip;  
    }
}

// ************************************************************************* //
